Revit 2027 API
MEPNetworkIterator.SystemId Property
 The optional MEP system element id where the iterations are restricted.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SystemId { get; set; }
Public Property SystemId As ElementId
	Get
	Set
public:
property ElementId^ SystemId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SystemId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace